IOsonata/IOsonata/ARM/Nordic/nRF54/src/bt_app_bm.cpp
// ===========================================================================
// SMP user interaction bridge (sdk-nrf-bm / Peer Manager port, S145).
//
// The SoftDevice owns the SMP exchange and surfaces the user steps as GAP
// events: BLE_GAP_EVT_PASSKEY_DISPLAY (Numeric Comparison when match_request is
// set, otherwise Passkey Entry display) and BLE_GAP_EVT_AUTH_KEY_REQUEST
// (Passkey Entry input). These are bridged to the same BtSmp* interaction API
// the generic SMP host exposes, so an application sees one set of callbacks
// across ports. The reply functions route the user answer back through
// sd_ble_gap_auth_key_reply. The generic weak defaults live in bt_smp.cpp,
// which is not linked on this port, so equivalent weak defaults are provided
// here; an application strong definition overrides them.
// ===========================================================================

// Pairing configuration supplied through the common BtSmp API. The S145
// SoftDevice owns SMP, so this target stores the values until Peer Manager
// builds its ble_gap_sec_params_t.
static bool    s_bSmpAuthCfgValid;
static uint8_t s_SmpIoCaps = BT_SMP_IOCAPS_NO_INPUT_NO_OUTPUT;
static uint8_t s_SmpAuthReq =
	BT_SMP_AUTHREQ_BONDING_FLAG_BONDING | BT_SMP_AUTHREQ_SC;

void BtSmpAuthConfig(uint8_t IoCaps, uint8_t AuthReq)
{
	if (IoCaps > BT_SMP_IOCAPS_KEYBOARD_DISPLAY)
	{
		return;
	}

	s_SmpIoCaps = IoCaps;
	s_SmpAuthReq = (uint8_t)(AuthReq | BT_SMP_AUTHREQ_SC);
	s_bSmpAuthCfgValid = true;
}

static void BmSmpAuthApply(ble_gap_sec_params_t *pSecParams)
{
	if (!s_bSmpAuthCfgValid || pSecParams == nullptr)
	{
		return;
	}

	switch (s_SmpIoCaps)
	{
		case BT_SMP_IOCAPS_DISPLAY_ONLY:
			pSecParams->io_caps = BLE_GAP_IO_CAPS_DISPLAY_ONLY;
			break;
		case BT_SMP_IOCAPS_DISPLAY_YESNO:
			pSecParams->io_caps = BLE_GAP_IO_CAPS_DISPLAY_YESNO;
			break;
		case BT_SMP_IOCAPS_KEYBOARD_ONLY:
			pSecParams->io_caps = BLE_GAP_IO_CAPS_KEYBOARD_ONLY;
			break;
		case BT_SMP_IOCAPS_KEYBOARD_DISPLAY:
			pSecParams->io_caps = BLE_GAP_IO_CAPS_KEYBOARD_DISPLAY;
			break;
		case BT_SMP_IOCAPS_NO_INPUT_NO_OUTPUT:
		default:
			pSecParams->io_caps = BLE_GAP_IO_CAPS_NONE;
			break;
	}

	pSecParams->bond =
		(s_SmpAuthReq & BT_SMP_AUTHREQ_BONDING_FLAG_MASK) !=
		BT_SMP_AUTHREQ_BONDING_FLAG_NO_BONDING;
	pSecParams->mitm = (s_SmpAuthReq & BT_SMP_AUTHREQ_MITM) != 0U;
	pSecParams->lesc = 1;
	pSecParams->keypress = (s_SmpAuthReq & BT_SMP_AUTHREQ_KEYPRESS) != 0U;
}

// SoftDevice passkey octets are six ASCII digits, most significant first.
// Convert to the six digit integer used by the BtSmp interaction API.
static uint32_t BmPasskeyToVal(const uint8_t *pAscii)
{
	uint32_t v = 0;
	for (int i = 0; i < BLE_GAP_PASSKEY_LEN; i++)
	{
		v = v * 10 + (uint32_t)(pAscii[i] - '0');
	}
	return v;
}

// Convert the six digit integer to six ASCII digits, most significant first,
// zero padded, for sd_ble_gap_auth_key_reply.
static void BmPasskeyFromVal(uint32_t Val, uint8_t *pAscii)
{
	for (int i = BLE_GAP_PASSKEY_LEN - 1; i >= 0; i--)
	{
		pAscii[i] = (uint8_t)('0' + (Val % 10));
		Val /= 10;
	}
}

// Resume Numeric Comparison. Confirm true reports a match (reply PASSKEY type
// with no key), false reports no match (reply NONE) and aborts pairing.
void BtSmpNumericComparisonReply(uint16_t ConnHdl, bool Confirm)
{
	(void)sd_ble_gap_auth_key_reply(ConnHdl,
			Confirm ? BLE_GAP_AUTH_KEY_TYPE_PASSKEY : BLE_GAP_AUTH_KEY_TYPE_NONE,
			NULL);
}

// Resume Passkey Entry on the input side. A value in 0..999999 is sent as six
// ASCII digits; a value above that range cancels with a NONE reply.
void BtSmpPasskeyReply(uint16_t ConnHdl, uint32_t Passkey)
{
	if (Passkey > 999999u)
	{
		(void)sd_ble_gap_auth_key_reply(ConnHdl, BLE_GAP_AUTH_KEY_TYPE_NONE, NULL);
		return;
	}

	uint8_t ascii[BLE_GAP_PASSKEY_LEN];
	BmPasskeyFromVal(Passkey, ascii);
	(void)sd_ble_gap_auth_key_reply(ConnHdl, BLE_GAP_AUTH_KEY_TYPE_PASSKEY, ascii);
}

// LE Secure Connections OOB data (strong overrides of the generic weak API).
// On this target BtLesc owns the SC key pair, so the local OOB set comes
// from it and the peer set is staged here; the peer data handler hands it to
// the pairing with the link peer address filled in.
static ble_gap_lesc_oob_data_t s_BtAppPeerOob;
static bool s_BtAppPeerOobValid = false;

static ble_gap_lesc_oob_data_t *BtAppOobPeerDataHandler(uint16_t ConnHdl)
{
	if (!s_BtAppPeerOobValid)
	{
		DEBUG_PRINTF("SEC: no OOB peer data, pairing will fail\r\n");
		return NULL;
	}

	BtDevice_t *pPeer = BtPeerFindByHdl(ConnHdl);
	if (pPeer != nullptr)
	{
		s_BtAppPeerOob.addr.addr_type = pPeer->Conn.PeerAddrType;
		memcpy(s_BtAppPeerOob.addr.addr, pPeer->Conn.PeerAddr, 6);
	}

	return &s_BtAppPeerOob;
}

int BtSmpOobLocalDataGen(BtHciDevice_t * const pDev, uint8_t * const pRand, uint8_t * const pConf)
{
	(void)pDev;

	if (pRand == NULL || pConf == NULL)
	{
		return -1;
	}
	if (!BtLescOobLocalGen())
	{
		return -1;
	}

	ble_gap_lesc_oob_data_t *p = BtLescOobLocalGet();
	if (p == NULL)
	{
		return -1;
	}

	memcpy(pRand, p->r, 16);
	memcpy(pConf, p->c, 16);

	return 0;
}

void BtSmpOobPeerDataSet(const uint8_t * const pRand, const uint8_t * const pConf)
{
	if (pRand == NULL || pConf == NULL)
	{
		return;
	}
	memset(&s_BtAppPeerOob, 0, sizeof(s_BtAppPeerOob));
	memcpy(s_BtAppPeerOob.r, pRand, 16);
	memcpy(s_BtAppPeerOob.c, pConf, 16);
	s_BtAppPeerOobValid = true;
}

void BtSmpOobDataClear(void)
{
	s_BtAppPeerOobValid = false;
	memset(&s_BtAppPeerOob, 0, sizeof(s_BtAppPeerOob));
}

// Weak defaults. With no application override the only safe action is to reject,
// so the user interaction cannot be performed silently. An application that can
// display or input overrides these.
__attribute__((weak)) void BtSmpNumericComparison(uint16_t ConnHdl, uint32_t Value)
{
	(void)Value;
	BtSmpNumericComparisonReply(ConnHdl, false);
}

__attribute__((weak)) void BtSmpPasskeyDisplay(uint16_t ConnHdl, uint32_t Passkey)
{
	(void)ConnHdl;
	(void)Passkey;
}

__attribute__((weak)) void BtSmpPasskeyRequest(uint16_t ConnHdl)
{
	BtSmpPasskeyReply(ConnHdl, BT_SMP_PASSKEY_INVALID);
}

// --- BLE event dispatch (registered as observer) ---

static void ble_evt_dispatch(const ble_evt_t *p_ble_evt, void *p_context)
{
	uint32_t err_code;
	const ble_gap_evt_t *p_gap_evt = &p_ble_evt->evt.gap_evt;
	uint8_t role = pm_conn_state_role(p_ble_evt->evt.gap_evt.conn_handle);

	DEBUG_PRINTF("evt: 0x%x\r\n", p_ble_evt->header.evt_id);
	switch (p_ble_evt->header.evt_id)
	{
		case BLE_GAP_EVT_CONNECTED:
			BtAppConnLedOn();
			BtPeerConnected(p_gap_evt->conn_handle, role,
							   p_gap_evt->params.connected.peer_addr.addr_type,
							   (uint8_t *)p_gap_evt->params.connected.peer_addr.addr);
			g_BtAppData.State = BTAPP_STATE_CONNECTED;
			BtAppEvtConnected(p_ble_evt->evt.gap_evt.conn_handle);

			// Initiate link security if the app is configured secure. For an
			// already-bonded peer this encrypts with the stored LTK; otherwise
			// it starts pairing. peer_manager drives the procedure.
			if (g_BtAppData.AppDevice.bSecure)
			{
				(void)pm_conn_secure(p_gap_evt->conn_handle, false);
			}
			break;

		case BLE_GAP_EVT_DISCONNECTED:
		{
			uint16_t connHdl = p_ble_evt->evt.gap_evt.conn_handle;
			BtDevice_t *pPeer = BtPeerFindByHdl(connHdl);

			BtAppConnLedOff();
			BtPeerFree(pPeer);

			if (BtPeerIsConnected() == false)
			{
				g_BtAppData.State = BTAPP_STATE_IDLE;
			}

