IOsonata/IOsonata/ARM/Nordic/nRF54/src/bt_app_bm.cpp
			BtAppEvtDisconnected(connHdl);

			if (g_BtAppData.AppDevice.Conn.Role & (BTAPP_ROLE_PERIPHERAL | BTAPP_ROLE_BROADCASTER))
			{
				BtAdvStart();
			}
		}
			break;

		case BLE_GAP_EVT_CONN_SEC_UPDATE:
		{
			const ble_gap_conn_sec_t *pcs = &p_gap_evt->params.conn_sec_update.conn_sec;
			// Capture the negotiated encryption key size for BtGapConnSecGet.
			// pm_conn_sec_status_get does not report key size; this event does.
			BtDevice_t *pdev = BtPeerFindByHdl(p_gap_evt->conn_handle);
			if (pdev != nullptr)
			{
				pdev->Conn.Sec.KeySize = pcs->encr_key_size;
			}
		}
			break;

		case BLE_GAP_EVT_PASSKEY_DISPLAY:
		{
			const ble_gap_evt_passkey_display_t *pPd =
					&p_gap_evt->params.passkey_display;
			uint16_t connHdl = p_gap_evt->conn_handle;
			uint32_t val = BmPasskeyToVal(pPd->passkey);
			if (pPd->match_request)
			{
				// LESC Numeric Comparison: the application confirms the match
				// through BtSmpNumericComparisonReply.
				BtSmpNumericComparison(connHdl, val);
			}
			else
			{
				// Passkey Entry display side: show the value the peer enters.
				BtSmpPasskeyDisplay(connHdl, val);
			}
		}
			break;

		case BLE_GAP_EVT_AUTH_KEY_REQUEST:
			if (p_gap_evt->params.auth_key_request.key_type ==
				BLE_GAP_AUTH_KEY_TYPE_PASSKEY)
			{
				// Passkey Entry input side: the application provides the value
				// through BtSmpPasskeyReply.
				BtSmpPasskeyRequest(p_gap_evt->conn_handle);
			}
			break;

		case BLE_GAP_EVT_ADV_SET_TERMINATED:
			BtAppAdvTimeoutHandler();
			break;

		case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
		{
			const ble_gap_phys_t phys = {
				BLE_GAP_PHY_AUTO,
				BLE_GAP_PHY_AUTO,
			};
			err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
			(void)err_code;
		}
		break;

		case BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST:
		{
			ble_gap_data_length_params_t dl_params;
			memset(&dl_params, 0, sizeof(dl_params));
			err_code = sd_ble_gap_data_length_update(
				p_ble_evt->evt.gap_evt.conn_handle, &dl_params, NULL);
			(void)err_code;
		}
		break;

		case BLE_GATTS_EVT_SYS_ATTR_MISSING:
			err_code = sd_ble_gatts_sys_attr_set(
				BtAppGetConnHandle(), NULL, 0, 0);
			(void)err_code;
			break;

		case BLE_EVT_USER_MEM_REQUEST:
			{
				// Long write: hand the SoftDevice this link's reassembly buffer.
				// Replied once per connection (not per service) to avoid
				// multiple sd_ble_user_mem_reply calls on the same request.
				BtDevice_t *pConn = BtPeerFindByHdl(p_ble_evt->evt.common_evt.conn_handle);
				if (pConn != nullptr && pConn->Conn.pLongWrBuff != nullptr)
				{
					ble_user_mem_block_t mblk;
					memset(&mblk, 0, sizeof(mblk));
					mblk.p_mem = pConn->Conn.pLongWrBuff;
					mblk.len   = pConn->Conn.LongWrBuffSize;
					memset(pConn->Conn.pLongWrBuff, 0, pConn->Conn.LongWrBuffSize);
					err_code = sd_ble_user_mem_reply(p_ble_evt->evt.common_evt.conn_handle, &mblk);
					(void)err_code;
				}
			}
			break;

		case BLE_GATTC_EVT_TIMEOUT:
			sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
								  BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
			break;

		case BLE_GATTS_EVT_TIMEOUT:
			sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
								  BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
			break;

		case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST:
		{
			uint16_t mtu = g_BtAppData.AppDevice.Conn.MaxMtu;
			err_code = sd_ble_gatts_exchange_mtu_reply(
				p_ble_evt->evt.gatts_evt.conn_handle, mtu);
			(void)err_code;
		}
		break;

		default:
			break;
	}

	// Forward to central/observer handlers
	if ((role == BLE_GAP_ROLE_CENTRAL) ||
		(role == BLE_GAP_ROLE_INVALID &&
		 (g_BtAppData.AppDevice.Conn.Role & (BTAPP_ROLE_CENTRAL | BTAPP_ROLE_OBSERVER))))
	{
		switch (p_ble_evt->header.evt_id)
		{
			case BLE_GAP_EVT_ADV_REPORT:
			{
				const ble_gap_evt_adv_report_t *p_adv_report =
					&p_gap_evt->params.adv_report;
				bool keep_going = BtAppScanReport(p_adv_report->rssi,
								p_adv_report->peer_addr.addr_type,
								(uint8_t *)p_adv_report->peer_addr.addr,
								p_adv_report->data.len,
								p_adv_report->data.p_data);
				// S145 stops reporting after each adv packet; the app must
				// re-arm the scan or explicitly stop it.
				if (keep_going)
				{
					BtAppScan();
				}
				else
				{
					BtAppScanStop();
				}
			}
			break;

			case BLE_GAP_EVT_TIMEOUT:
			{
				const ble_gap_evt_timeout_t *p_timeout =
					&p_gap_evt->params.timeout;
				if (p_timeout->src == BLE_GAP_TIMEOUT_SRC_SCAN)
				{
					g_BtAppData.bScan = false;
				}
			}
			break;

			case BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP:
				BtAppDiscPrimSrvcRsp(&p_ble_evt->evt.gattc_evt);
				break;

			case BLE_GATTC_EVT_CHAR_DISC_RSP:
				BtAppDiscCharRsp(&p_ble_evt->evt.gattc_evt);
				break;

			case BLE_GATTC_EVT_DESC_DISC_RSP:
				BtAppDiscDescRsp(&p_ble_evt->evt.gattc_evt);
				break;

			case BLE_GATTC_EVT_HVX:
				{
					const ble_gattc_evt_hvx_t *p_hvx = &p_ble_evt->evt.gattc_evt.params.hvx;
					BtGattClientNotified(p_ble_evt->evt.gattc_evt.conn_handle,
					                     p_hvx->handle, (uint8_t *)p_hvx->data, p_hvx->len);
					// An indication must be confirmed by the client.
					if (p_hvx->type == BLE_GATT_HVX_INDICATION)
					{
						sd_ble_gattc_hv_confirm(p_ble_evt->evt.gattc_evt.conn_handle,
						                        p_hvx->handle);
					}
				}
				break;

			default:
				break;
		}
		BtAppCentralEvtHandler((uint32_t)p_ble_evt->header.evt_id, (void *)p_ble_evt);
	}

	// Forward to peripheral handlers
	if ((role == BLE_GAP_ROLE_PERIPH) ||
		(role == BLE_GAP_ROLE_INVALID &&
		 (g_BtAppData.AppDevice.Conn.Role & BTAPP_ROLE_PERIPHERAL)))
	{
		// HVN TX complete gives a count, not a handle. Drain the per-peer
		// send-order ring once per event.
		if (p_ble_evt->header.evt_id == BLE_GATTS_EVT_HVN_TX_COMPLETE)
		{
			BtGattSendCompleted(p_ble_evt->evt.gatts_evt.conn_handle,
				p_ble_evt->evt.gatts_evt.params.hvn_tx_complete.count);
		}
		else if (p_ble_evt->header.evt_id == BLE_GATTS_EVT_HVC)
		{
			// Client confirmed the outstanding indication.
			BtGattHandleValueConfirm(p_ble_evt->evt.gatts_evt.conn_handle);
		}
		BtGattEvtHandler((uint32_t)p_ble_evt->header.evt_id, (void *)p_ble_evt);
		BtAppPeriphEvtHandler((uint32_t)p_ble_evt->header.evt_id, (void *)p_ble_evt);
	}
}

// Note: SoC event polling is handled internally by nrf_sdh_soc.c
// which registers its own NRF_SDH_STACK_EVT_OBSERVER.

// --- Advertising ---


/**
 * @brief Overloadable advertising initialization
 */


// --- Notify ---

bool BtAppNotify(BtGattChar_t *pChar, uint8_t *pData, uint16_t DataLen)
{
	if (pChar == nullptr)
	{
		return false;
	}

	if (DataLen > 0 && pData == nullptr)
	{
		return false;
	}

	if (DataLen > 0 && BtGattCharSetValue(pChar, pData, DataLen) == false)
	{
		return false;
	}

	// Delegate the send to BtGattCharNotify so the notification is tracked in
	// the TX-pending ring and TxCompleteCB fires on completion.
	return BtGattCharNotify(BtAppGetConnHandle(), pChar, pData, DataLen);
}

