IOsonata/IOsonata/ARM/Nordic/nRF54/src/bt_app_bm.cpp
	DEBUG_PRINTF("BtAppStackInit: SDBleDefaultCfgSet\r\n");
	err = SDBleDefaultCfgSet(pCfg, BTAPP_CONN_CFG_TAG, ramstart);
	DEBUG_PRINTF("BtAppStackInit: SDBleDefaultCfgSet returned 0x%lx\r\n",
				 (unsigned long)err);

	if (err != NRF_SUCCESS)
	{
		return false;
	}

	// Required before calling sd_ble_enable.
	DEBUG_PRINTF("BtAppStackInit: SDBleRandSeed\r\n");
	SDBleRandSeed(NRF_EVT_RAND_SEED_REQUEST, NULL);
	DEBUG_PRINTF("BtAppStackInit: SDBleRandSeed done\r\n");

	DEBUG_PRINTF("BtAppStackInit: sd_ble_enable\r\n");

	uint32_t ramreq = ramstart;

	err = sd_ble_enable(&ramreq);
	DEBUG_PRINTF("BtAppStackInit: sd_ble_enable returned 0x%lx ram=0x%08lx\r\n",
				 (unsigned long)err, (unsigned long)ramreq);

	if (err != NRF_SUCCESS)
	{
		if (ramreq > ramstart)
		{
			DEBUG_PRINTF("%x - Insufficient RAM allocated for the SoftDevice need %x",
						 err, ramreq);
		}
		else
		{
			DEBUG_PRINTF("sd_ble_enable failed: 0x%x\r\n", err);
		}
		return false;
	}

	(void)sdh_state_evt_observer_notify(NRF_SDH_STATE_EVT_BLE_ENABLED);

	// 1 s continuous wakeup trigger so a fully silent link still reaches the
	// GATT transaction timeout checks in the main loop. Enabled only after
	// the SoftDevice is up: GRTC3 must be initialized with its interrupt
	// disabled before nrf_sdh_enable_request. No handler is needed, the GRTC
	// interrupt itself ends the WFE wait; the ISR tolerates a null handler.
	s_BtAppSdGrtc3.EnableTimerTrigger(0, 1000UL, TIMER_TRIG_TYPE_CONTINUOUS, nullptr);

	// Enable BLE stack (cfg_set from CONFIG_ defaults, handled in nrf_sdh_ble.c)
	//err = nrf_sdh_ble_enable(BTAPP_CONN_CFG_TAG);
	//if (err)
	//{
//		DEBUG_PRINTF("nrf_sdh_ble_enable failed: %d\r\n", err);
//		return false;
//	}

	// Initialize connection state tracking
	//ble_conn_state_init();

	return true;
}

// ---------------------------------------------------------------------------
// Secure Connections: peer_manager + BtLesc, mirroring the nRF52
// SoftDevice implementation. The S145 SoftDevice owns the SMP state machine; peer_manager
// drives it and persists bonds (through the IOsonata bt_pds store), and
// BtLesc performs the LESC ECDH. The application observes link security
// through these peer_manager events; no key material is surfaced to the app on
// this path (peer_manager is the authority), matching nRF52.
// ---------------------------------------------------------------------------

#define BT_APP_SEC_PARAM_MIN_KEY_SIZE	7
#define BT_APP_SEC_PARAM_MAX_KEY_SIZE	16

static void BtAppPmEvtHandler(const struct pm_evt *p_evt)
{
	// Standard peer_manager housekeeping: applies the event to internal state,
	// disconnects on security failure, and cleans flash on data update.
	pm_handler_on_pm_evt(p_evt);
	pm_handler_disconnect_on_sec_failure(p_evt);
	pm_handler_flash_clean(p_evt);

	switch (p_evt->evt_id)
	{
		case PM_EVT_CONN_SEC_SUCCEEDED:
			// Link is encrypted. peer_manager holds the bond. Notify the app so
			// it can run work that needs an encrypted link (e.g. a central
			// reading protected characteristics). (nRF52 optionally enforces
			// MITM here; left permissive.)
			BtAppEvtSecured(p_evt->conn_handle);
			break;

		case PM_EVT_CONN_SEC_FAILED:
			// Security setup failed. pm_handler_disconnect_on_sec_failure above
			// already tears the link down when required.
			break;

		case PM_EVT_CONN_SEC_CONFIG_REQ:
		{
			// Allow an already-bonded peer to re-pair.
			struct pm_conn_sec_config cfg = { .allow_repairing = true };
			pm_conn_sec_config_reply(p_evt->conn_handle, &cfg);
		}
			break;

		case PM_EVT_STORAGE_FULL:
			// The IOsonata bt_pds store compacts itself on write, so unlike the
			// nRF52 fds_gc() path there is nothing to trigger here.
			break;

		case PM_EVT_PEERS_DELETE_SUCCEEDED:
			// Bonds cleared. Resume advertising if we are a peripheral.
			if (g_BtAppData.AppDevice.Conn.Role &
				(BTAPP_ROLE_PERIPHERAL | BTAPP_ROLE_BROADCASTER))
			{
				BtAdvStart();
			}
			break;

		default:
			break;
	}
}

// Initialize peer_manager and LESC. Maps the app SecType / key-exchange config
// onto ble_gap_sec_params_t exactly as the nRF52 implementation does (the BTAPP_SECTYPE_*
// values alias the same BT_GAP_SECTYPE_* the nRF52 BLEAPP_SECTYPE_* use).
static uint32_t BtAppPeerMngrInit(BTGAP_SECTYPE SecType, uint8_t SecKeyExchg, bool bEraseBond)
{
	ble_gap_sec_params_t sec_param;
	uint32_t err_code;

	// Provide the LESC layer its crypto engine BEFORE pm_init. With CONFIG_PM_LESC
	// defined, pm_init -> sm_init calls BtLescInit, which checks the engine
	// via CryptoIsCapable. The engine must already be injected at that point, else
	// BtLescInit fails and pm_init returns an error. The App owns the
	// CryptoDev_t and injects it, mirroring the BtSmpInit model on the SDC port.
	// ECDH goes through CryptoInit with CRYPTO_PROVIDER_AUTO: the hardware
	// engine (CryptoHwInit, PSA over CRACEN) is selected when it is linked,
	// otherwise it falls back to software uECC, with no change to the LESC
	// code. The arena is sized CRYPTO_MEMSIZE_ECDH, which fits whichever engine
	// AUTO selects. Random bytes come from the PSA DRBG on the hardware path,
	// or from the CRACEN-backed RngGet on the uECC path.
	static CryptoDev_t s_LescEcdh;
	alignas(uint32_t) static uint8_t s_LescEcdhMem[CRYPTO_MEMSIZE_ECDH];
	CryptoCfg_t lescCfg = { };
	lescCfg.Provider = CRYPTO_PROVIDER_AUTO;
	lescCfg.ReqCaps  = CRYPTO_CAP_ECDH_P256;
	lescCfg.pMem     = s_LescEcdhMem;
	lescCfg.MemSize  = sizeof(s_LescEcdhMem);
	if (CryptoInit(&s_LescEcdh, &lescCfg))
	{
		DEBUG_PRINTF("Crypto ECDH engine: %s\r\n", CryptoName(&s_LescEcdh));
	}
	else
	{
		// No P-256 engine was linked. LE Secure Connections pairing cannot
		// run. Report it here rather than at the first pairing attempt.
		DEBUG_PRINTF("Crypto ECDH engine MISSING, LESC pairing will fail\r\n");
	}

	BtLescSetCryptoEngine(&s_LescEcdh);

	DEBUG_PRINTF("BtAppPeerMngrInit: pm_init\r\n");
	err_code = pm_init();
	DEBUG_PRINTF("BtAppPeerMngrInit: pm_init returned 0x%lx\r\n",
				 (unsigned long)err_code);
	if (err_code != NRF_SUCCESS)
	{
		DEBUG_PRINTF("pm_init failed: 0x%x\r\n", err_code);
		return err_code;
	}

	if (bEraseBond)
	{
		(void)pm_peers_delete();
	}

	memset(&sec_param, 0, sizeof(sec_param));

	sec_param.bond           = 1;
	sec_param.min_key_size   = BT_APP_SEC_PARAM_MIN_KEY_SIZE;
	sec_param.max_key_size   = BT_APP_SEC_PARAM_MAX_KEY_SIZE;
	sec_param.kdist_own.enc  = 1;
	sec_param.kdist_own.id   = 1;
	sec_param.kdist_peer.enc = 1;
	sec_param.kdist_peer.id  = 1;

	switch (SecType)
	{
		case BTGAP_SECTYPE_NONE:
		case BTGAP_SECTYPE_STATICKEY_NO_MITM:
			break;
		case BTGAP_SECTYPE_STATICKEY_MITM:
			sec_param.mitm = 1;
			break;
		case BTGAP_SECTYPE_LESC_MITM:
			sec_param.mitm = 1;
			sec_param.lesc = 1;
			break;
		case BTGAP_SECTYPE_SIGNED_NO_MITM:
			sec_param.lesc = 1;
			break;
		case BTGAP_SECTYPE_SIGNED_MITM:
			sec_param.mitm = 1;
			sec_param.lesc = 1;
			break;
		default:
			break;
	}

	int exchg = SecKeyExchg & (BTAPP_SECEXCHG_KEYBOARD | BTAPP_SECEXCHG_DISPLAY | BTAPP_SECEXCHG_YESNO);
	switch (exchg)
	{
		case BTAPP_SECEXCHG_KEYBOARD:
			sec_param.keypress = 1;
			sec_param.io_caps  = BLE_GAP_IO_CAPS_KEYBOARD_ONLY;
			break;
		case BTAPP_SECEXCHG_DISPLAY:
			sec_param.io_caps  = BLE_GAP_IO_CAPS_DISPLAY_ONLY;
			break;
		case (BTAPP_SECEXCHG_DISPLAY | BTAPP_SECEXCHG_YESNO):
			sec_param.io_caps  = BLE_GAP_IO_CAPS_DISPLAY_YESNO;
			break;
		case (BTAPP_SECEXCHG_KEYBOARD | BTAPP_SECEXCHG_DISPLAY):
		case (BTAPP_SECEXCHG_KEYBOARD | BTAPP_SECEXCHG_DISPLAY | BTAPP_SECEXCHG_YESNO):
			sec_param.keypress = 1;
			sec_param.io_caps  = BLE_GAP_IO_CAPS_KEYBOARD_DISPLAY;
			break;
		default:
			break;
	}

	if (SecKeyExchg & BTAPP_SECEXCHG_OOB)
	{
		sec_param.oob = 1;
	}

	// BtSmpAuthConfig is the common application-facing API. On this target it
	// overrides the association parameters before Peer Manager stores them.
	BmSmpAuthApply(&sec_param);

	err_code = pm_sec_params_set(&sec_param);
	if (err_code != NRF_SUCCESS)
	{
		DEBUG_PRINTF("pm_sec_params_set failed: 0x%x\r\n", err_code);
		return err_code;
	}

	err_code = pm_register(BtAppPmEvtHandler);
	if (err_code != NRF_SUCCESS)
	{
		DEBUG_PRINTF("pm_register failed: 0x%x\r\n", err_code);
		return err_code;
	}

