IOsonata/IOsonata/ARM/Nordic/nRF54/src/bt_app_bm.cpp
	// Every service and characteristic processed. Discovery complete.
	BtDeviceDiscovered(pDev);
}

static void BtAppDiscPrimSrvcRsp(const ble_gattc_evt_t *pEvt)
{
	BtDevice_t *pDev = s_pDiscDev;
	if (pDev == NULL)
	{
		return;
	}

	if (pEvt->gatt_status == BLE_GATT_STATUS_SUCCESS)
	{
		const ble_gattc_evt_prim_srvc_disc_rsp_t *p = &pEvt->params.prim_srvc_disc_rsp;
		uint16_t lastEnd = 0;

		for (uint16_t i = 0; i < p->count; i++)
		{
			if (pDev->NbSrvc >= BT_DEV_SERVICE_MAXCNT)
			{
				break;
			}

			BtGattDBSrvc_t *pSrvc = &pDev->Services[pDev->NbSrvc];
			pSrvc->srv_uuid.BaseIdx = 0;
			pSrvc->srv_uuid.Type    = BT_UUID_TYPE_16;
			pSrvc->srv_uuid.Uuid    = p->services[i].uuid.uuid;
			pSrvc->handle_range.StartHdl = p->services[i].handle_range.start_handle;
			pSrvc->handle_range.EndHdl   = p->services[i].handle_range.end_handle;
			pSrvc->char_count = 0;
			lastEnd = p->services[i].handle_range.end_handle;
			pDev->NbSrvc++;
		}

		// Continue past the last range unless DB end or local table full.
		if (lastEnd != 0xFFFF && pDev->NbSrvc < BT_DEV_SERVICE_MAXCNT &&
		    sd_ble_gattc_primary_services_discover(pDev->Conn.Hdl, lastEnd + 1, NULL) == NRF_SUCCESS)
		{
			return;
		}
	}

	// ATTRIBUTE_NOT_FOUND, DB end, or table full: service phase done.
	s_DiscSrvIdx = 0;
	BtAppDiscStartChar(pDev);
}

static void BtAppDiscCharRsp(const ble_gattc_evt_t *pEvt)
{
	BtDevice_t *pDev = s_pDiscDev;
	if (pDev == NULL)
	{
		return;
	}

	BtGattDBSrvc_t *pSrvc = &pDev->Services[s_DiscSrvIdx];

	if (pEvt->gatt_status == BLE_GATT_STATUS_SUCCESS)
	{
		const ble_gattc_evt_char_disc_rsp_t *p = &pEvt->params.char_disc_rsp;
		uint16_t lastVal = 0;

		for (uint16_t i = 0; i < p->count; i++)
		{
			if (pSrvc->char_count >= BT_GATT_DB_MAX_CHARS)
			{
				break;
			}

			BtGattDBChar_t         *pCh  = &pSrvc->characteristics[pSrvc->char_count];
			const ble_gattc_char_t *pSrc = &p->chars[i];

			pCh->characteristic.uuid.BaseIdx = 0;
			pCh->characteristic.uuid.Type    = BT_UUID_TYPE_16;
			pCh->characteristic.uuid.Uuid    = pSrc->uuid.uuid;

			pCh->characteristic.char_props.broadcast      = pSrc->char_props.broadcast;
			pCh->characteristic.char_props.read           = pSrc->char_props.read;
			pCh->characteristic.char_props.write_wo_resp  = pSrc->char_props.write_wo_resp;
			pCh->characteristic.char_props.write          = pSrc->char_props.write;
			pCh->characteristic.char_props.notify         = pSrc->char_props.notify;
			pCh->characteristic.char_props.indicate       = pSrc->char_props.indicate;
			pCh->characteristic.char_props.auth_signed_wr = pSrc->char_props.auth_signed_wr;

			pCh->characteristic.char_ext_props = pSrc->char_ext_props;
			pCh->characteristic.handle_decl    = pSrc->handle_decl;
			pCh->characteristic.handle_value   = pSrc->handle_value;

			pCh->cccd_handle       = BLE_GATT_HANDLE_INVALID;
			pCh->ext_prop_handle   = BLE_GATT_HANDLE_INVALID;
			pCh->user_desc_handle  = BLE_GATT_HANDLE_INVALID;
			pCh->report_ref_handle = BLE_GATT_HANDLE_INVALID;

			lastVal = pSrc->handle_value;
			pSrvc->char_count++;
		}

		// Continue characteristics within the same service range.
		if (lastVal != 0 && lastVal < 0xFFFF && pSrvc->char_count < BT_GATT_DB_MAX_CHARS &&
		    (lastVal + 1) <= pSrvc->handle_range.EndHdl)
		{
			ble_gattc_handle_range_t range;
			range.start_handle = lastVal + 1;
			range.end_handle   = pSrvc->handle_range.EndHdl;
			if (sd_ble_gattc_characteristics_discover(pDev->Conn.Hdl, &range) == NRF_SUCCESS)
			{
				return;
			}
		}
	}

	// Service complete (ATTRIBUTE_NOT_FOUND, table full, or error). Advance.
	s_DiscSrvIdx++;
	BtAppDiscStartChar(pDev);
}

static void BtAppDiscDescRsp(const ble_gattc_evt_t *pEvt)
{
	BtDevice_t *pDev = s_pDiscDev;
	if (pDev == NULL)
	{
		return;
	}

	if (pEvt->gatt_status == BLE_GATT_STATUS_SUCCESS)
	{
		const ble_gattc_evt_desc_disc_rsp_t *p = &pEvt->params.desc_disc_rsp;
		BtGattDBSrvc_t *pSrvc = &pDev->Services[s_DiscSrvIdx];
		BtGattDBChar_t *pCh   = &pSrvc->characteristics[s_DiscCharIdx];

		for (uint16_t i = 0; i < p->count; i++)
		{
			switch (p->descs[i].uuid.uuid)
			{
				case BT_UUID_DESCRIPTOR_CLIENT_CHARACTERISTIC_CONFIGURATION:
					pCh->cccd_handle = p->descs[i].handle;
					break;
				case BT_UUID_DESCRIPTOR_CHARACTERISTIC_EXTENDED_PROPERTIES:
					pCh->ext_prop_handle = p->descs[i].handle;
					break;
				case BT_UUID_DESCRIPTOR_CHARACTERISTIC_USER_DESCRIPTION:
					pCh->user_desc_handle = p->descs[i].handle;
					break;
				case BT_UUID_DESCRIPTOR_REPORT_REFERENCE:
					pCh->report_ref_handle = p->descs[i].handle;
					break;
				default:
					break;
			}
		}
	}

	// Advance to the next characteristic regardless of result.
	s_DiscCharIdx++;
	BtAppDiscStartDesc(pDev);
}

bool BtAppWrite(uint16_t ConnHandle, uint16_t CharHandle, uint8_t *pData, uint16_t DataLen)
{
	if (ConnHandle == BLE_CONN_HANDLE_INVALID ||
	    CharHandle == BLE_CONN_HANDLE_INVALID ||
	    pData == nullptr || DataLen == 0)
	{
		return false;
	}

	ble_gattc_write_params_t const write_params = {
		.write_op = BLE_GATT_OP_WRITE_CMD,
		.flags    = BLE_GATT_EXEC_WRITE_FLAG_PREPARED_WRITE,
		.handle   = CharHandle,
		.offset   = 0,
		.len      = DataLen,
		.p_value  = pData,
	};

	return sd_ble_gattc_write(ConnHandle, &write_params) == NRF_SUCCESS;
}

bool BtAppEnableNotify(uint16_t ConnHandle, uint16_t CccdHandle)
{
	if (ConnHandle == BLE_CONN_HANDLE_INVALID ||
	    CccdHandle == BLE_CONN_HANDLE_INVALID)
	{
		return false;
	}

	// CCCD = 16-bit little endian, bit 0 = notify, bit 1 = indicate.
	// CCCD value length is fixed at 2 bytes by the Bluetooth GATT spec.
	uint8_t buf[2] = { BLE_GATT_HVX_NOTIFICATION, 0 };

	ble_gattc_write_params_t const write_params = {
		.write_op = BLE_GATT_OP_WRITE_REQ,    // CCCD writes are write-with-response per spec
		.flags    = BLE_GATT_EXEC_WRITE_FLAG_PREPARED_WRITE,
		.handle   = CccdHandle,
		.offset   = 0,
		.len      = sizeof(buf),
		.p_value  = buf,
	};

	return sd_ble_gattc_write(ConnHandle, &write_params) == NRF_SUCCESS;
}

//
// bt_lesc port hooks. sdk-nrf-bm's sd_ble_gap_lesc_dhkey_reply takes a security
// status; the peer-key table is sized from the configured link count.
//
extern "C" uint32_t BtLescDhKeyReply(uint16_t ConnHdl, uint8_t SecStatus,
									 const ble_gap_lesc_dhkey_t *pDhKey)
{
	return sd_ble_gap_lesc_dhkey_reply(ConnHdl, SecStatus, pDhKey);
}

extern "C" int BtLescLinkCount(void)
{
	return CONFIG_NRF_SDH_BLE_TOTAL_LINK_COUNT;
}
